# Câu 9: Giải thích kết quả tính toán của các biểu thức
i1, i2, i3 = 2, 5, -3
d1, d2, d3 = 2.0, 5.0, -0.5

print(i1 + (i2 * i3))     # a) 2 + (5 * -3) = -13
print(i1 * (i2 + i3))     # b) 2 * (5 + -3) = 4
print(i1 / (i2 + i3))     # c) 2 / (5 + -3) = 1.0
print(i1 // (i2 + i3))    # d) 2 // 2 = 1
print(i1 / i2 + i3)       # e) (2/5) + (-3) = -2.6
print(i1 // i2 + i3)      # f) (0) + (-3) = -3
print(3 + 4 + 5 / 3)      # g) 3+4+(5/3)=8.666...
print(3 + 4 + 5 // 3)     # h) 3+4+(1)=8
print((3 + 4 + 5) / 3)    # i) 12/3=4.0
print((3 + 4 + 5) // 3)   # j) 12//3=4
print(d1 + (d2 * d3))     # k) 2.0 + (5.0 * -0.5) = -0.5
print(d1 + d2 * d3)       # l) giống k, do ưu tiên * trước + = -0.5
print(d1 / d2 - d3)       # m) (2/5) - (-0.5) = 0.9
print(d1 / (d2 - d3))     # n) 2 / (5 - -0.5) = 0.3636...
print(d1 + d2 + d3 / 3)   # o) 2+5+(-0.5/3)=6.833...
print((d1 + d2 + d3) / 3) # p) (2+5-0.5)/3=2.166...
print(d1 + d2 + (d3 / 3)) # q) 2+5+(-0.5/3)=6.833..
print(3 * (d1 + d2) * (d1 - d3)) # r) 3*(7.0)*(2.5)=52.5